![titanic](https://media.istockphoto.com/id/464771689/photo/ocean-liner.jpg?b=1&s=612x612&w=0&k=20&c=-__T5VU6p7SZ7xUWZADwwodFF9rTF5egxNLJPP0oX9c=)

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [2]:
df = pd.read_csv('titanic.csv')

In [3]:
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [4]:
df.tail()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
886,887,"Montvila, Rev. Juozas",2,male,27.0,0,0,211536,13.00,NaN,S,0
887,888,"Graham, Miss. Margaret Edith",1,female,19.0,0,0,112053,30.00,B42,S,1
888,889,"Johnston, Miss. Catherine Helen ""Carrie""",3,female,NaN,1,2,W./C. 6607,23.45,NaN,S,0
889,890,"Behr, Mr. Karl Howell",1,male,26.0,0,0,111369,30.00,C148,C,1
890,891,"Dooley, Mr. Patrick",3,male,32.0,0,0,370376,7.75,NaN,Q,0

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Name         891 non-null    object
 2   Pclass       891 non-null    int64
 3   Sex          891 non-null    object
 4   Age          714 non-null    float64
 5   SibSp        891 non-null    int64
 6   Parch        891 non-null    int64
 7   Ticket       891 non-null    object
 8   Fare         891 non-null    float64
 9   Cabin        204 non-null    object
 10  Embarked     889 non-null    object
 11  Survived     891 non-null    int64
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [6]:
df = df.drop(['PassengerId','Name','Pclass','SibSp','Parch','Ticket','Cabin','Embarked'],axis=1)

In [7]:
df

        Sex   Age     Fare  Survived
0      male  22.0   7.2500         0
1    female  38.0  71.2833         1
2    female  26.0   7.9250         1
3    female  35.0  53.1000         1
4      male  35.0   8.0500         0
..      ...   ...      ...       ...
886    male  27.0  13.0000         0
887  female  19.0  30.0000         1
888  female   NaN  23.4500         0
889    male  26.0  30.0000         1
890    male  32.0   7.7500         0

[891 rows x 4 columns]

In [8]:
df.isnull().sum()

Sex           0
Age         177
Fare          0
Survived      0
dtype: int64

In [9]:
df['Age'] = df['Age'].fillna(df['Age'].mean())

In [10]:
df.isnull().sum()

Sex         0
Age         0
Fare        0
Survived    0
dtype: int64

In [ ]:
cat_features = ['Sex']

# Installing catboost

In [16]:
from catboost import Pool

In [17]:
X = df.drop('Survived',axis=1)
y = df['Survived']

In [18]:
train_pool = Pool(data = X,label = y,cat_features =cat_features )

# Model Training

In [19]:
from catboost import CatBoostClassifier
model = CatBoostClassifier(iterations=100,depth=6,learning_rate=0.1,loss_function='Logloss')

In [21]:
model.fit(train_pool)

0:	learn: 0.6603871	total: 139ms	remaining: 13.7s
1:	learn: 0.6343104	total: 140ms	remaining: 6.84s
2:	learn: 0.6089335	total: 141ms	remaining: 4.57s
3:	learn: 0.5874608	total: 142ms	remaining: 3.42s
4:	learn: 0.5709496	total: 143ms	remaining: 2.72s
5:	learn: 0.5579391	total: 144ms	remaining: 2.26s
6:	learn: 0.5438242	total: 146ms	remaining: 1.94s
7:	learn: 0.5354969	total: 146ms	remaining: 1.68s
8:	learn: 0.5283566	total: 147ms	remaining: 1.49s
9:	learn: 0.5202180	total: 149ms	remaining: 1.34s
10:	learn: 0.5132663	total: 151ms	remaining: 1.22s
11:	learn: 0.5074868	total: 152ms	remaining: 1.11s
12:	learn: 0.5027014	total: 152ms	remaining: 1.02s
13:	learn: 0.4988173	total: 153ms	remaining: 940ms
14:	learn: 0.4934432	total: 155ms	remaining: 876ms
15:	learn: 0.4913401	total: 155ms	remaining: 814ms
16:	learn: 0.4866078	total: 157ms	remaining: 765ms
17:	learn: 0.4822219	total: 159ms	remaining: 722ms
18:	learn: 0.4797302	total: 160ms	remaining: 681ms
19:	learn: 0.4765268	total: 161ms	remaining: 642ms
20:	learn: 0.4744559	total: 162ms	remaining: 608ms
21:	learn: 0.4718430	total: 163ms	remaining: 579ms
22:	learn: 0.4691123	total: 166ms	remaining: 556ms
23:	learn: 0.4678808	total: 168ms	remaining: 533ms
24:	learn: 0.4657730	total: 170ms	remaining: 510ms
25:	learn: 0.4643453	total: 172ms	remaining: 490ms
26:	learn: 0.4624085	total: 174ms	remaining: 470ms
27:	learn: 0.4607363	total: 176ms	remaining: 453ms
28:	learn: 0.4596743	total: 178ms	remaining: 435ms
29:	learn: 0.4573067	total: 179ms	remaining: 418ms
30:	learn: 0.4553564	total: 181ms	remaining: 402ms
31:	learn: 0.4539448	total: 182ms	remaining: 387ms
32:	learn: 0.4527741	total: 184ms	remaining: 374ms
33:	learn: 0.4518956	total: 185ms	remaining: 360ms
34:	learn: 0.4507461	total: 187ms	remaining: 347ms
35:	learn: 0.4506129	total: 188ms	remaining: 334ms
36:	learn: 0.4495516	total: 189ms	remaining: 322ms
37:	learn: 0.4490654	total: 191ms	remaining: 311ms
38:	learn: 0.4467538	total: 192ms	remaining: 300ms
39:	learn: 0.4458657	total: 194ms	remaining: 290ms
40:	learn: 0.4447938	total: 195ms	remaining: 281ms
41:	learn: 0.4436133	total: 197ms	remaining: 272ms
42:	learn: 0.4417658	total: 198ms	remaining: 263ms
43:	learn: 0.4414168	total: 199ms	remaining: 253ms
44:	learn: 0.4404993	total: 201ms	remaining: 245ms
45:	learn: 0.4394594	total: 202ms	remaining: 237ms
46:	learn: 0.4393177	total: 204ms	remaining: 230ms
47:	learn: 0.4388134	total: 206ms	remaining: 223ms
48:	learn: 0.4375368	total: 208ms	remaining: 217ms
49:	learn: 0.4363998	total: 211ms	remaining: 211ms
50:	learn: 0.4359562	total: 213ms	remaining: 205ms
51:	learn: 0.4356933	total: 215ms	remaining: 198ms
52:	learn: 0.4348888	total: 216ms	remaining: 192ms
53:	learn: 0.4333792	total: 218ms	remaining: 186ms
54:	learn: 0.4327923	total: 219ms	remaining: 180ms
55:	learn: 0.4321384	total: 221ms	remaining: 174ms
56:	learn: 0.4314968	total: 223ms	remaining: 168ms
57:	learn: 0.4311717	total: 224ms	remaining: 162ms
58:	learn: 0.4304625	total: 225ms	remaining: 157ms
59:	learn: 0.4302333	total: 227ms	remaining: 151ms
60:	learn: 0.4298746	total: 228ms	remaining: 146ms
61:	learn: 0.4292052	total: 230ms	remaining: 141ms
62:	learn: 0.4284502	total: 231ms	remaining: 136ms
63:	learn: 0.4283169	total: 233ms	remaining: 131ms
64:	learn: 0.4271042	total: 235ms	remaining: 127ms
65:	learn: 0.4261226	total: 237ms	remaining: 122ms
66:	learn: 0.4259219	total: 239ms	remaining: 117ms
67:	learn: 0.4252938	total: 240ms	remaining: 113ms
68:	learn: 0.4251319	total: 242ms	remaining: 109ms
69:	learn: 0.4250116	total: 243ms	remaining: 104ms
70:	learn: 0.4244877	total: 245ms	remaining: 100ms
71:	learn: 0.4236250	total: 246ms	remaining: 95.8ms
72:	learn: 0.4235460	total: 247ms	remaining: 91.5ms
73:	learn: 0.4233281	total: 249ms	remaining: 87.4ms
74:	learn: 0.4221051	total: 250ms	remaining: 83.5ms
75:	learn: 0.4218691	total: 252ms	remaining: 79.5ms
76:	learn: 0.4218003	total: 253ms	remaining: 75.7ms
77:	learn: 0.4215203	total: 255ms	remaining: 71.8ms
78:	learn: 0.4208444	total: 257ms	remaining: 68.2ms
79:	learn: 0.4198874	total: 258ms	remaining: 64.5ms
80:	learn: 0.4183406	total: 260ms	remaining: 60.9ms
81:	learn: 0.4180312	total: 261ms	remaining: 57.3ms
82:	learn: 0.4177144	total: 263ms	remaining: 53.8ms
83:	learn: 0.4174971	total: 264ms	remaining: 50.3ms
84:	learn: 0.4171883	total: 266ms	remaining: 46.9ms
85:	learn: 0.4169118	total: 267ms	remaining: 43.5ms
86:	learn: 0.4166459	total: 269ms	remaining: 40.1ms
87:	learn: 0.4165171	total: 270ms	remaining: 36.8ms
88:	learn: 0.4155629	total: 272ms	remaining: 33.6ms
89:	learn: 0.4150075	total: 273ms	remaining: 30.4ms
90:	learn: 0.4142745	total: 275ms	remaining: 27.2ms
91:	learn: 0.4138117	total: 277ms	remaining: 24.1ms
92:	learn: 0.4133011	total: 279ms	remaining: 21ms
93:	learn: 0.4128478	total: 281ms	remaining: 17.9ms
94:	learn: 0.4125575	total: 283ms	remaining: 14.9ms
95:	learn: 0.4123785	total: 285ms	remaining: 11.9ms
96:	learn: 0.4117176	total: 287ms	remaining: 8.88ms
97:	learn: 0.4109999	total: 289ms	remaining: 5.89ms
98:	learn: 0.4106517	total: 290ms	remaining: 2.93ms
99:	learn: 0.4100068	total: 293ms	remaining: 0us

In [22]:
from sklearn.metrics import accuracy_score,classification_report
y_pred = model.predict(train_pool)

In [25]:
accuracy = accuracy_score(y,y_pred)
accuracy

0.8148148148148148

In [26]:
print(classification_report(y,y_pred))

              precision    recall  f1-score   support

           0       0.84      0.86      0.85       549
           1       0.77      0.74      0.75       342

    accuracy                           0.81       891
   macro avg       0.81      0.80      0.80       891
weighted avg       0.81      0.81      0.81       891

In [27]:
feature_importance = model.get_feature_importance(prettified = True)

In [28]:
feature_importance

  Feature Id  Importances
0        Sex    60.575392
1       Fare    25.900567
2        Age    13.524041

# Testing

In [29]:
new_passenger = pd.DataFrame({
    'Sex':['male'],
    'Age':['25'],
    'Fare':[10]
})

In [30]:
new_passenger_pool = Pool(data=new_passenger, cat_features=cat_features)

In [31]:
predictions = model.predict(new_passenger_pool)

In [32]:
print("Predicted Survival: ",predictions)

Predicted Survival:  [0]

In [ ]:
# assignment : Movies,diabetes

In [ ]:

#